app/views/users/_non_profile_show.html.erb


 <% @user.tweets.each do |tweet| %>
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = $1  [["user_id", "17"]]