app/views/users/_profile_page.html.erb

SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = $1  [["user_id", "19"]]
---

	 <% @user.tweets.each do |tweet| %>

SELECT "following_relationships".* FROM "following_relationships" WHERE "following_relationships"."user_id" = $1  [["user_id", 19]]
---
<p> Users you are following: </p>
<% @user.following_relationships.each do |following_relationship| %>