app/controllers/following_relationships_controller.rb

  def create
    @following_relationship = current_user.following_relationships.new(:followed_user_id => params[:followed_user_id])
    followed_user = User.where({:id => @following_relationship.followed_user_id}).first
    if @following_relationship.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 19]]
INSERT INTO "following_relationships" ("user_id", "followed_user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 19], ["followed_user_id", 18], ["created_at", "2015-02-27 21:41:51.086551"], ["updated_at", "2015-02-27 21:41:51.086551"]]