app/controllers/tweets_controller.rb

  def create
    @tweets = Tweet.all
    @tweet = current_user.tweets.new(tweet_params)
    if @tweet.save
---
SELECT "tweets".* FROM "tweets"
INSERT INTO "tweets" ("title", "text", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "First Tweet!"], ["text", "This is the first Tweet!"], ["user_id", "4"], ["created_at", "2015-02-24 22:43:18.016769"], ["updated_at", "2015-02-24 22:43:18.016769"]]